In [1]:
import pandas as pd

In [6]:
df=pd.read_csv('C:\\Users\DIWAKAR\Downloads\Data_Preprocessing\Data.csv')

In [8]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [9]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [10]:
df.head(3)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [11]:
df.tail()

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
df.tail(3)

   Country   Age   Salary Purchased
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [13]:
df.sample(5)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
6    Spain   NaN  52000.0        No
9   France  37.0  67000.0       Yes
1    Spain  27.0  48000.0       Yes
4  Germany  40.0      NaN       Yes

In [20]:
df[['Country','Age']]

   Country   Age
0   France  44.0
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0
4  Germany  40.0
5   France  35.0
6    Spain   NaN
7   France  48.0
8  Germany  50.0
9   France  37.0

In [23]:
df[df.Country=='Spain']

  Country   Age   Salary Purchased
1   Spain  27.0  48000.0       Yes
3   Spain  38.0  61000.0        No
6   Spain   NaN  52000.0        No

In [24]:
df[df.Age==48]

  Country   Age   Salary Purchased
7  France  48.0  79000.0       Yes

In [25]:
df[df.Country=='Spain']['Age']

1    27.0
3    38.0
6     NaN
Name: Age, dtype: float64

In [30]:
df[df.Country=='Spain'][['Age']].head(2)

    Age
1  27.0
3  38.0

In [32]:
df[df.Country=='Spain'].count()

Country      3
Age          2
Salary       3
Purchased    3
dtype: int64

In [34]:
df.Age.sum()

349.0

In [35]:
df.Country.sum()

'FranceSpainGermanySpainGermanyFranceSpainFranceGermanyFrance'

In [36]:
df.Age.max()

50.0

In [37]:
df.Age.median()

38.0

In [38]:
df.groupby('Country').count()

         Age  Salary  Purchased
Country
France     4       4          4
Germany    3       2          3
Spain      2       3          3